<?xml version="1.0" encoding="UTF-8"?>
<!--
    Example Jamf Configuration Profile payload: Local Password Policy
    Scope and profile metadata are configured in Jamf Pro UI;
    this file represents the payload content.
-->
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
 "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>PayloadDescription</key>
            <string>Enforces basic local password policy.</string>
            <key>PayloadDisplayName</key>
            <string>Password Policy</string>
            <key>PayloadIdentifier</key>
            <string>com.yourcompany.passwordpolicy</string>
            <key>PayloadType</key>
            <string>com.apple.mobiledevice.passwordpolicy</string>
            <key>PayloadUUID</key>
            <string>00000000-0000-0000-0000-000000000001</string>
            <key>PayloadVersion</key>
            <integer>1</integer>

            <!-- Require passcode -->
            <key>allowSimple</key>
            <false/>
            <key>forcePIN</key>
            <true/>
            <key>maxFailedAttempts</key>
            <integer>10</integer>
            <key>maxGracePeriod</key>
            <integer>300</integer> <!-- 5 min -->
            <key>maxInactivity</key>
            <integer>900</integer> <!-- 15 min -->
            <key>minLength</key>
            <integer>8</integer>
            <key>minComplexChars</key>
            <integer>1</integer>
            <key>requireAlphanumeric</key>
            <true/>
        </dict>
    </array>

    <key>PayloadDescription</key>
    <string>Example configuration profile payload for Jamf Pro.</string>
    <key>PayloadDisplayName</key>
    <string>YourCompany Password Policy</string>
    <key>PayloadIdentifier</key>
    <string>com.yourcompany.config.passwordpolicy</string>
    <key>PayloadOrganization</key>
    <string>YourCompany</string>
    <key>PayloadRemovalDisallowed</key>
    <true/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>00000000-0000-0000-0000-000000000000</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
